TestEDT/src/Documents/РасходнаяНакладная/РасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходнаяНакладная</name>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <tabularSections>
    <name>СписокНоменклатуры</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TestEDT/src/AccumulationRegisters/ОстаткиНоменклатуры/ОстаткиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиНоменклатуры</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

TestEDT/src/InformationRegisters/УчетнаяПолитика/УчетнаяПолитика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитика</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>УчетнаяПолитика</name>
    <type>
      <types>EnumRef.УчетнаяПолитика</types>
    </type>
  </resources>
</mdclass:InformationRegister>

TestEDT/src/Enums/УчетнаяПолитика/УчетнаяПолитика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УчетнаяПолитика</name>
  <enumValues>
    <name>ФИФО</name>
  </enumValues>
  <enumValues>
    <name>Средняя</name>
  </enumValues>
</mdclass:Enum>

TestEDT/src/Documents/РасходнаяНакладная/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиНоменклатуры");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = СписокНоменклатуры;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");

	Блокировка.Заблокировать();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура,
	|	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Количество) КАК Количество
	|ПОМЕСТИТЬ ВременнаяТаблица1
	|ИЗ
	|	Документ.РасходнаяНакладная.СписокНоменклатуры КАК РасходнаяНакладнаяСписокНоменклатуры
	|ГДЕ
	|	РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
	|	И РасходнаяНакладнаяСписокНоменклатуры.Номенклатура.ВидНоменклатуры = &ВидНоменклатуры
	|СГРУППИРОВАТЬ ПО
	|	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица1.Номенклатура КАК Номенклатура,
	|	ВременнаяТаблица1.Количество КАК Количество,
	|	ОстаткиНоменклатурыОстатки.Партия КАК Партия,
	|	ЕстьNull(СУММА(ОстаткиНоменклатурыОстатки.КоличествоОстаток),0) КАК КоличествоОстаток,
	|	ЕстьNull(СУММА(ОстаткиНоменклатурыОстатки.СуммаОстаток),0) КАК СуммаОстаток
	|ИЗ
	|	ВременнаяТаблица1 КАК ВременнаяТаблица1
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНоменклатуры.Остатки(&Дата, Номенклатура В
	|			(ВЫБРАТЬ
	|				ВременнаяТаблица1.Номенклатура
	|			ИЗ
	|				ВременнаяТаблица1 КАК ВременнаяТаблица1)) КАК ОстаткиНоменклатурыОстатки
	|		ПО ВременнаяТаблица1.Номенклатура = ОстаткиНоменклатурыОстатки.Номенклатура
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблица1.Номенклатура,
	|	ВременнаяТаблица1.Количество,
	|	ОстаткиНоменклатурыОстатки.Партия
	|
	|УПОРЯДОЧИТЬ ПО
	|	Партия
	|ИТОГИ
	|	МАКСИМУМ(Количество) КАК Количество,
	|	МАКСИМУМ(СуммаОстаток) КАК СуммаОстаток,
	|	СУММА(КоличествоОстаток)
	|ПО
	|	Номенклатура";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидНоменклатуры", Перечисления.ВидыНоменклатуры.Товар);
	Запрос.УстановитьПараметр("Дата", Дата);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	МетодСписания=РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(Дата, );
	Пока ВыборкаНоменклатура.Следующий() Цикл
		Если ВыборкаНоменклатура.Количество > ВыборкаНоменклатура.КоличествоОстаток Тогда
			Сообщить("Товара " + ВыборкаНоменклатура.Номенклатура + " не хватает. есть = "
				+ ВыборкаНоменклатура.КоличествоОстаток);
			Отказ=Истина;
		КонецЕсли;
		Если Не Отказ Тогда
			Выборка = ВыборкаНоменклатура.Выбрать();
			Осталось = ВыборкаНоменклатура.Количество;
			Пока Осталось > 0 И Выборка.Следующий() Цикл
				Движение = Движения.ОстаткиНоменклатуры.Добавить();
				Движение.Период = Дата;
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Номенклатура = Выборка.Номенклатура;
				Движение.Партия = Выборка.Партия;
				Движение.Количество = Мин(Осталось, Выборка.КоличествоОстаток);
				Если МетодСписания.УчетнаяПолитика = ПредопределенноеЗначение("Перечисление.УчетнаяПолитика.ФИФО") Тогда
					Движение.Сумма =Движение.Количество / Выборка.КоличествоОстаток * Выборка.СуммаОстаток;
				Иначе
					Движение.Сумма =Движение.Количество / ВыборкаНоменклатура.КоличествоОстаток
						* ВыборкаНоменклатура.СуммаОстаток;
				КонецЕсли;

				Осталось=Осталось - Движение.Количество;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	Движения.ОстаткиНоменклатуры.Записывать = Истина;

	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
